results/2026-07-09_v7_agentic/lfm2.5-8b-a1b/toolagent/bench.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31217, dataset_name='mooncake', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v7_agentic/lfm2.5-8b-a1b/toolagent/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31217, dataset_name='mooncake', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v7_agentic/lfm2.5-8b-a1b/toolagent/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)

Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Using time-based Mooncake request scheduler, ignoring --request-rate.
Starting Mooncake trace replay. Sessions: 200, Rounds per session: 1. Slowdown factor: 1.0
100%|██████████| 200/200 [00:37<00:00,  5.27it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  37.97     
Total input tokens:                      533310    
Total input text tokens:                 533310    
Total generated tokens:                  41463     
Total generated tokens (retokenized):    41463     
Request throughput (req/s):              5.27      
Input token throughput (tok/s):          14044.63  
Output token throughput (tok/s):         1091.92   
Peak output token throughput (tok/s):    3606.00   
Peak concurrent requests:                27        
Total token throughput (tok/s):          15136.55  
Concurrency:                             6.13      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1163.99   
Median E2E Latency (ms):                 998.33    
P90 E2E Latency (ms):                    2280.03   
P99 E2E Latency (ms):                    3444.95   
---------------Time to First Token----------------
Mean TTFT (ms):                          414.40    
Median TTFT (ms):                        356.72    
P99 TTFT (ms):                           1017.28   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.90     
Median TPOT (ms):                        3.63      
P99 TPOT (ms):                           265.04    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           3.63      
Median ITL (ms):                         2.97      
P95 ITL (ms):                            4.79      
P99 ITL (ms):                            7.96      
Max ITL (ms):                            787.34    
==================================================